app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "There Will Be Blood"], ["genre", "Drama"], ["created_at", 2016-07-31 20:09:34 UTC], ["updated_at", 2016-07-31 20:09:34 UTC]]

def update
  @movie = Movie.find(params[:id])

  if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "movies" SET "genre" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["genre", "Comedy"], ["updated_at", 2016-07-31 20:43:27 UTC], ["id", 5]]